/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: k210_clint.h
**
** 创   建   人: Yu.KangZhi (余康志)
**
** 文件创建日期: 2018 年 10 月 18 日
**
** 描        述: Machine Mode CLIC 中断控制器驱动头文件
*********************************************************************************************************/
#ifndef __K210_CLINT_H
#define __K210_CLINT_H
/*********************************************************************************************************
  CLIC 中断控制器接口
*********************************************************************************************************/
INT clintMTimeCmpSet(UINT uiHartId, UINT uiValue);
INT clintMTimeCmpGet(UINT uiHartId);
INT clintMTimeGet(VOID);

INT clintIpiInit(VOID);
INT clintIpiEnable(VOID);
INT clintIpiDisable(VOID);
INT clintIpiSend(UINT uiCoreId);
INT clintIpiClear(UINT uiCoreId);

#endif                                                                  /* __K210_CLINT_H               */
/*********************************************************************************************************
  END
*********************************************************************************************************/
