/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: k210_aes.h
**
** 创   建   人: Yu.KangZhi (余康志)
**
** 文件创建日期: 2018 年 10 月 23 日
**
** 描        述: 高级加密加速器(AES)驱动头文件
*********************************************************************************************************/
#ifndef __K210_AES_H
#define __K210_AES_H
/*********************************************************************************************************
  包含IOCTL命令定义相关头文件
*********************************************************************************************************/
#include <sys/ioccom.h>                                                 /*       使用 _IO 宏            */
/*********************************************************************************************************
  包含相关结构体类型的定义
*********************************************************************************************************/
#include "KendryteWare/include/aes.h"                                   /*       aes_cipher_mode_t      */
/*********************************************************************************************************
  AES ioctl 命令 (AES 加速器支持多种加密/解密模式(ECB,CBC,GCM), 多种长度的KEY(128,192,256) 的运算)
*********************************************************************************************************/
#define AES_ECB128_HARD_DECRYPT      _IO('a',0x01)                      /*       AES-ECB-128            */
#define AES_ECB128_HARD_ENCRYPT      _IO('a',0x02)
#define AES_ECB192_HARD_DECRYPT      _IO('a',0x03)                      /*       AES-ECB-192            */
#define AES_ECB192_HARD_ENCRYPT      _IO('a',0x04)
#define AES_ECB256_HARD_DECRYPT      _IO('a',0x05)                      /*       AES-ECB-256            */
#define AES_ECB256_HARD_ENCRYPT      _IO('a',0x06)
#define AES_CBC128_HARD_DECRYPT      _IO('a',0x07)                      /*       AES-CBC-128            */
#define AES_CBC128_HARD_ENCRYPT      _IO('a',0x10)
#define AES_CBC192_HARD_DECRYPT      _IO('a',0x11)                      /*       AES-CBC-192            */
#define AES_CBC192_HARD_ENCRYPT      _IO('a',0x12)
#define AES_CBC256_HARD_DECRYPT      _IO('a',0x13)                      /*       AES-CBC-256            */
#define AES_CBC256_HARD_ENCRYPT      _IO('a',0x14)
#define AES_GCM128_HARD_DECRYPT      _IO('a',0x15)                      /*       AES-GCM-128            */
#define AES_GCM128_HARD_ENCRYPT      _IO('a',0x16)
#define AES_GCM192_HARD_DECRYPT      _IO('a',0x17)                      /*       AES-GCM-192            */
#define AES_GCM192_HARD_ENCRYPT      _IO('a',0x20)
#define AES_GCM256_HARD_DECRYPT      _IO('a',0x21)                      /*       AES-GCM-256            */
#define AES_GCM256_HARD_ENCRYPT      _IO('a',0x22)
/*********************************************************************************************************
 加密事务结构体 AES WORK MESSAGE (注意: 为方便调用裸机库，该结构体命名不遵循 SylixOS 命名规范)
*********************************************************************************************************/
typedef struct {
    aes_cipher_mode_t     encrypt_mode;                                 /* 加密/解密模式(ECB,CBC,GCM)   */
    UINT8                *input_key;                                    /* 加密的密钥(输入参数)         */
    UINT8                *input_data;                                   /* 待加密的明文数据(输入参数)   */
    size_t                input_len;                                    /* 待加密明文数据长度(输入参数) */
    UINT8                *output_data;                                  /* 加密运算后的存放在这个buffer */

    UINT8                *cbs_gcm_iv;                                   /* CBC/GCM 模式下的初始化向量   */

    UINT8                *gcm_aad;                                      /* GCM 空或额外的数据           */
    size_t                gcm_aad_len;                                  /* GCM 额外的数据长度           */
    UINT8                *gcm_tag;                                      /* 存放加密运算后的tag，固定16B */
} aes_work_t;
/*********************************************************************************************************
** 函数名称: k210AesDrv
** 功能描述: 安装 AES 驱动
** 输　入  : NONE
** 输　出  : ERROR_CODE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
INT  k210AesDrv(VOID);
/*********************************************************************************************************
** 函数名称: k210AesDevAdd
** 功能描述: 创建 AES 设备
** 输　入  : NONE
** 输　出  : ERROR_CODE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
INT  k210AesDevAdd(VOID);

#endif                                                                  /*      __K210_AES_H            */
/*********************************************************************************************************
  END
*********************************************************************************************************/
