/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: videoFileHandle.h
**
** 创   建   人: Yu.KangZhi (余康志)
**
** 文件创建日期: 2018 年 11 月 28 日
**
** 描        述: video device 文件操作框架层接口头文件
*********************************************************************************************************/

#ifndef __VIDEOFILEHANDLE_H
#define __VIDEOFILEHANDLE_H

/*********************************************************************************************************
   超前声明
*********************************************************************************************************/
struct lw_video_device;
/*********************************************************************************************************

*********************************************************************************************************/
typedef struct lw_video_file_handles {
    void       (*video_fh_open)(struct lw_video_device*   pVideoDevice);
    void       (*video_fh_close)(struct lw_video_device*  pVideoDevice);
} LW_VIDEO_FILE_HANDLES, *PLW_VIDEO_FILE_HANDLES;

/*********************************************************************************************************

*********************************************************************************************************/
LONG     API_VideoFileOpen(PLW_DEV_HDR pDev, PCHAR pcName, INT iFlags, INT iMode);

INT      API_VideoFileClose(PLW_FD_ENTRY pFdEntry);

INT      API_VideoFileLstat(PLW_DEV_HDR pDev, PCHAR pcName, struct stat *pStat);

ssize_t  API_VideoFileRead(PLW_FD_ENTRY  pFdEntry, PCHAR  pcBuffer, size_t  stMaxBytes);

#endif                                                                  /*      __VIDEOFILEHANDLE_H     */
/*********************************************************************************************************
  END
*********************************************************************************************************/
