/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: k210_dmac.h
**
** 创   建   人: Yu.KangZhi (余康志)
**
** 文件创建日期: 2018 年 10 月 19 日
**
** 描        述: DMA 控制器驱动头文件
*********************************************************************************************************/
#ifndef __K210_DMAC_H
#define __K210_DMAC_H
/*********************************************************************************************************
  头文件包含
*********************************************************************************************************/
#include "KendryteWare/include/dmac.h"
/*********************************************************************************************************
  定义
*********************************************************************************************************/
#define DMA_CHANNEL_NR        (6)
#define DMA_MAX_TRANS_SIZE    (8 * LW_CFG_KB_SIZE)

/*********************************************************************************************************
 * burst size
 ********************************************************************************************************/
#define DMA_BURST_SIZE_SHIFT                     (0)
#define DMA_BURST_SIZE_MASK                      (0xF)
#define DMA_TARNS_MODE_BURST_SIZE(burst_size)    ((burst_size & DMA_BURST_SIZE_MASK) \
                                                            << DMA_BURST_SIZE_SHIFT)
/*********************************************************************************************************
 * transfer_width
 ********************************************************************************************************/
#define DMA_TRANS_WIDTH_SHIFT                    (4)
#define DMA_TRANS_WIDTH_MASK                     (0xF)
#define DMA_TARNS_MODE_TRANS_WIDTH(trans_width)  ((trans_width & DMA_TRANS_WIDTH_MASK) \
                                                             << DMA_TRANS_WIDTH_SHIFT)
/*********************************************************************************************************
 * priority
 ********************************************************************************************************/
#define DMA_TRANS_PRIORITY_SHIFT                 (8)
#define DMA_TRANS_PRIORITY_MASK                  (0xF)
#define DMA_TARNS_MODE_PRIORITY(priority)        ((priority & DMA_TRANS_PRIORITY_MASK) \
                                                          << DMA_TRANS_PRIORITY_SHIFT)
/*********************************************************************************************************
 * 构建传输模式 (根据DMA的特性和用户要求自定义DMA传输模式)
 * 参数设置请参考: dmac_burst_trans_length_t, dmac_transfer_width_t, 0 ~ 7,
 ********************************************************************************************************/
#define DMA_MAKE_TARNS_MODE(burst_size, trans_width, priority)      \
        DMA_TARNS_MODE_BURST_SIZE(burst_size)   |                   \
        DMA_TARNS_MODE_TRANS_WIDTH(trans_width) |                   \
        DMA_TARNS_MODE_PRIORITY(priority)

/*********************************************************************************************************
 * 构建传输选项 (根据DMA的特性自定义DMA传输控制参数)
 * 参数设置请参考: sysctl_dma_select_t
 ********************************************************************************************************/
#define DMA_REQUEST_SOURCE_SHIFT       (0)
#define DMA_REQUEST_SOURCE_MASK        (0xFF)
#define DMA_REQUEST_SOURCE(request)    ((request & DMA_REQUEST_SOURCE_MASK) << DMA_REQUEST_SOURCE_SHIFT)
#define DMA_MAKE_OPTION(request)       DMA_REQUEST_SOURCE(request)

/*********************************************************************************************************
** 函数名称: dmaGetFuncs
** 功能描述: 获取 DMA 驱动程序
** 输　入  : uiChannel       DMA 通道号
**           pulMaxBytes     最大传输字节数
** 输　出  : 指定 DMA 通道的驱动程序
** 全局变量:
** 调用模块:
*********************************************************************************************************/
PLW_DMA_FUNCS  dmaGetFuncs(UINT  uiChannel, ULONG  *pulMaxBytes);

#endif                                                                  /*      __K210_DMAC_H           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
