/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: k210_kpu.h
**
** 创   建   人: Yu.KangZhi (余康志)
**
** 文件创建日期: 2018 年 12 月 10 日
**
** 描        述: KPU 控制器驱动头文件
*********************************************************************************************************/
#ifndef __K210_KPU_H
#define __K210_KPU_H

#include <sys/ioccom.h>

#define IOCTRL_KPU_TASK_INIT            _IO('k',0x01)
#define IOCTRL_KPU_CALCULATE_RUN        _IO('k',0x02)

typedef struct kpu_transaction
{
    PVOID       task;

    int         dma_ch;
    void        *src;
    void        *dst;
    int        (*ai_done_callback)(VOID *ctx);
    void        *arg;

} kpu_transaction_t;

INT  k210KpuDrv(VOID);
INT  k210KpuDevAdd(VOID);

#endif                                                                  /*          __K210_KPU_H        */
/*********************************************************************************************************
  END
*********************************************************************************************************/
